# CurtaingridBeltVert Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtaingridBeltVert Property
ParameterTypeId Class See Also
---
"Measurement Line"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtaingridBeltVert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtaingridBeltVert As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtaingridBeltVert {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace